src/Documents/Лут/Лут.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лут</name>
  <registerRecords>AccumulationRegister.Камни</registerRecords>
  <registerRecords>AccumulationRegister.Руны</registerRecords>
  <attributes>
    <name>Персонаж</name>
    <type>
      <types>CatalogRef.Персонаж</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Руны</name>
    <attributes>
      <name>Руна</name>
      <type>
        <types>CatalogRef.Руны</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Камни</name>
    <attributes>
      <name>Камень</name>
      <type>
        <types>CatalogRef.Камни</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/Руны/Руны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Руны</name>
  <resources>
    <name>КоличествоВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Персонаж</name>
    <type>
      <types>CatalogRef.Персонаж</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Руна</name>
    <type>
      <types>CatalogRef.Руны</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Камни/Камни.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Камни</name>
  <resources>
    <name>КоличествоВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Камень</name>
    <type>
      <types>CatalogRef.Камни</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Лут/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ВремТЗ = Руны.Выгрузить();
	ВремТЗ.Свернуть("Руна", "Количество");
	
	НаборЗаписей = Движения.Руны;
	НаборЗаписей.Записывать = Истина;
	
	Для Каждого СтрокаТЗ Из ВремТЗ Цикл
		НоваяСтрока = НаборЗаписей.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяСтрока.Персонаж = Персонаж;
		НоваяСтрока.Руна = СтрокаТЗ.Руна;
		НоваяСтрока.КоличествоВНаличии = СтрокаТЗ.Количество;
	КонецЦикла;
	
	НаборЗаписей = Движения.Камни;
	НаборЗаписей.Записывать = Истина;
	
	ВремТЗ = Камни.Выгрузить();
	ВремТЗ.Свернуть("Камень", "Количество");
	Для Каждого СтрокаТЗ Из ВремТЗ Цикл
		НоваяСтрока = НаборЗаписей.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяСтрока.Камень = СтрокаТЗ.Камень;
		НоваяСтрока.КоличествоВНаличии = СтрокаТЗ.Количество;
	КонецЦикла;
КонецПроцедуры
